SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_gpio_port.h
/* Bit fields for GPIO_P MODEH */
#define _GPIO_P_MODEH_RESETVALUE                0x00000000UL                            /**< Default value for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MASK                      0x0FFFFFFFUL                            /**< Mask for GPIO_P_MODEH                       */
#define _GPIO_P_MODEH_MODE0_SHIFT               0                                       /**< Shift value for GPIO_MODE0                  */
#define _GPIO_P_MODEH_MODE0_MASK                0xFUL                                   /**< Bit mask for GPIO_MODE0                     */
#define _GPIO_P_MODEH_MODE0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_P_MODEH               */
#define _GPIO_P_MODEH_MODE0_DISABLED            0x00000000UL                            /**< Mode DISABLED for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE0_INPUT               0x00000001UL                            /**< Mode INPUT for GPIO_P_MODEH                 */
#define _GPIO_P_MODEH_MODE0_INPUTPULL           0x00000002UL                            /**< Mode INPUTPULL for GPIO_P_MODEH             */
#define _GPIO_P_MODEH_MODE0_INPUTPULLFILTER     0x00000003UL                            /**< Mode INPUTPULLFILTER for GPIO_P_MODEH       */
#define _GPIO_P_MODEH_MODE0_PUSHPULL            0x00000004UL                            /**< Mode PUSHPULL for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE0_PUSHPULLALT         0x00000005UL                            /**< Mode PUSHPULLALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE0_WIREDOR             0x00000006UL                            /**< Mode WIREDOR for GPIO_P_MODEH               */
#define _GPIO_P_MODEH_MODE0_WIREDORPULLDOWN     0x00000007UL                            /**< Mode WIREDORPULLDOWN for GPIO_P_MODEH       */
#define _GPIO_P_MODEH_MODE0_WIREDAND            0x00000008UL                            /**< Mode WIREDAND for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE0_WIREDANDFILTER      0x00000009UL                            /**< Mode WIREDANDFILTER for GPIO_P_MODEH        */
#define _GPIO_P_MODEH_MODE0_WIREDANDPULLUP      0x0000000AUL                            /**< Mode WIREDANDPULLUP for GPIO_P_MODEH        */
#define _GPIO_P_MODEH_MODE0_WIREDANDPULLUPFILTER 0x0000000BUL                            /**< Mode WIREDANDPULLUPFILTER for GPIO_P_MODEH  */
#define _GPIO_P_MODEH_MODE0_WIREDANDALT         0x0000000CUL                            /**< Mode WIREDANDALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE0_WIREDANDALTFILTER   0x0000000DUL                            /**< Mode WIREDANDALTFILTER for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE0_WIREDANDALTPULLUP   0x0000000EUL                            /**< Mode WIREDANDALTPULLUP for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE0_WIREDANDALTPULLUPFILTER 0x0000000FUL                            /**< Mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE0_DEFAULT              (_GPIO_P_MODEH_MODE0_DEFAULT << 0)      /**< Shifted mode DEFAULT for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE0_DISABLED             (_GPIO_P_MODEH_MODE0_DISABLED << 0)     /**< Shifted mode DISABLED for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE0_INPUT                (_GPIO_P_MODEH_MODE0_INPUT << 0)        /**< Shifted mode INPUT for GPIO_P_MODEH         */
#define GPIO_P_MODEH_MODE0_INPUTPULL            (_GPIO_P_MODEH_MODE0_INPUTPULL << 0)    /**< Shifted mode INPUTPULL for GPIO_P_MODEH     */
#define GPIO_P_MODEH_MODE0_INPUTPULLFILTER      (_GPIO_P_MODEH_MODE0_INPUTPULLFILTER << 0) /**< Shifted mode INPUTPULLFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE0_PUSHPULL             (_GPIO_P_MODEH_MODE0_PUSHPULL << 0)     /**< Shifted mode PUSHPULL for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE0_PUSHPULLALT          (_GPIO_P_MODEH_MODE0_PUSHPULLALT << 0)  /**< Shifted mode PUSHPULLALT for GPIO_P_MODEH   */
#define GPIO_P_MODEH_MODE0_WIREDOR              (_GPIO_P_MODEH_MODE0_WIREDOR << 0)      /**< Shifted mode WIREDOR for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE0_WIREDORPULLDOWN      (_GPIO_P_MODEH_MODE0_WIREDORPULLDOWN << 0) /**< Shifted mode WIREDORPULLDOWN for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE0_WIREDAND             (_GPIO_P_MODEH_MODE0_WIREDAND << 0)     /**< Shifted mode WIREDAND for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE0_WIREDANDFILTER       (_GPIO_P_MODEH_MODE0_WIREDANDFILTER << 0) /**< Shifted mode WIREDANDFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE0_WIREDANDPULLUP       (_GPIO_P_MODEH_MODE0_WIREDANDPULLUP << 0) /**< Shifted mode WIREDANDPULLUP for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE0_WIREDANDPULLUPFILTER (_GPIO_P_MODEH_MODE0_WIREDANDPULLUPFILTER << 0) /**< Shifted mode WIREDANDPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE0_WIREDANDALT          (_GPIO_P_MODEH_MODE0_WIREDANDALT << 0)  /**< Shifted mode WIREDANDALT for GPIO_P_MODEH   */
#define GPIO_P_MODEH_MODE0_WIREDANDALTFILTER    (_GPIO_P_MODEH_MODE0_WIREDANDALTFILTER << 0) /**< Shifted mode WIREDANDALTFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE0_WIREDANDALTPULLUP    (_GPIO_P_MODEH_MODE0_WIREDANDALTPULLUP << 0) /**< Shifted mode WIREDANDALTPULLUP for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE0_WIREDANDALTPULLUPFILTER (_GPIO_P_MODEH_MODE0_WIREDANDALTPULLUPFILTER << 0) /**< Shifted mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/
#define _GPIO_P_MODEH_MODE1_SHIFT               4                                       /**< Shift value for GPIO_MODE1                  */
#define _GPIO_P_MODEH_MODE1_MASK                0xF0UL                                  /**< Bit mask for GPIO_MODE1                     */
#define _GPIO_P_MODEH_MODE1_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_P_MODEH               */
#define _GPIO_P_MODEH_MODE1_DISABLED            0x00000000UL                            /**< Mode DISABLED for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE1_INPUT               0x00000001UL                            /**< Mode INPUT for GPIO_P_MODEH                 */
#define _GPIO_P_MODEH_MODE1_INPUTPULL           0x00000002UL                            /**< Mode INPUTPULL for GPIO_P_MODEH             */
#define _GPIO_P_MODEH_MODE1_INPUTPULLFILTER     0x00000003UL                            /**< Mode INPUTPULLFILTER for GPIO_P_MODEH       */
#define _GPIO_P_MODEH_MODE1_PUSHPULL            0x00000004UL                            /**< Mode PUSHPULL for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE1_PUSHPULLALT         0x00000005UL                            /**< Mode PUSHPULLALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE1_WIREDOR             0x00000006UL                            /**< Mode WIREDOR for GPIO_P_MODEH               */
#define _GPIO_P_MODEH_MODE1_WIREDORPULLDOWN     0x00000007UL                            /**< Mode WIREDORPULLDOWN for GPIO_P_MODEH       */
#define _GPIO_P_MODEH_MODE1_WIREDAND            0x00000008UL                            /**< Mode WIREDAND for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE1_WIREDANDFILTER      0x00000009UL                            /**< Mode WIREDANDFILTER for GPIO_P_MODEH        */
#define _GPIO_P_MODEH_MODE1_WIREDANDPULLUP      0x0000000AUL                            /**< Mode WIREDANDPULLUP for GPIO_P_MODEH        */
#define _GPIO_P_MODEH_MODE1_WIREDANDPULLUPFILTER 0x0000000BUL                            /**< Mode WIREDANDPULLUPFILTER for GPIO_P_MODEH  */
#define _GPIO_P_MODEH_MODE1_WIREDANDALT         0x0000000CUL                            /**< Mode WIREDANDALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE1_WIREDANDALTFILTER   0x0000000DUL                            /**< Mode WIREDANDALTFILTER for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE1_WIREDANDALTPULLUP   0x0000000EUL                            /**< Mode WIREDANDALTPULLUP for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE1_WIREDANDALTPULLUPFILTER 0x0000000FUL                            /**< Mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE1_DEFAULT              (_GPIO_P_MODEH_MODE1_DEFAULT << 4)      /**< Shifted mode DEFAULT for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE1_DISABLED             (_GPIO_P_MODEH_MODE1_DISABLED << 4)     /**< Shifted mode DISABLED for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE1_INPUT                (_GPIO_P_MODEH_MODE1_INPUT << 4)        /**< Shifted mode INPUT for GPIO_P_MODEH         */
#define GPIO_P_MODEH_MODE1_INPUTPULL            (_GPIO_P_MODEH_MODE1_INPUTPULL << 4)    /**< Shifted mode INPUTPULL for GPIO_P_MODEH     */
#define GPIO_P_MODEH_MODE1_INPUTPULLFILTER      (_GPIO_P_MODEH_MODE1_INPUTPULLFILTER << 4) /**< Shifted mode INPUTPULLFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE1_PUSHPULL             (_GPIO_P_MODEH_MODE1_PUSHPULL << 4)     /**< Shifted mode PUSHPULL for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE1_PUSHPULLALT          (_GPIO_P_MODEH_MODE1_PUSHPULLALT << 4)  /**< Shifted mode PUSHPULLALT for GPIO_P_MODEH   */
#define GPIO_P_MODEH_MODE1_WIREDOR              (_GPIO_P_MODEH_MODE1_WIREDOR << 4)      /**< Shifted mode WIREDOR for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE1_WIREDORPULLDOWN      (_GPIO_P_MODEH_MODE1_WIREDORPULLDOWN << 4) /**< Shifted mode WIREDORPULLDOWN for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE1_WIREDAND             (_GPIO_P_MODEH_MODE1_WIREDAND << 4)     /**< Shifted mode WIREDAND for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE1_WIREDANDFILTER       (_GPIO_P_MODEH_MODE1_WIREDANDFILTER << 4) /**< Shifted mode WIREDANDFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE1_WIREDANDPULLUP       (_GPIO_P_MODEH_MODE1_WIREDANDPULLUP << 4) /**< Shifted mode WIREDANDPULLUP for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE1_WIREDANDPULLUPFILTER (_GPIO_P_MODEH_MODE1_WIREDANDPULLUPFILTER << 4) /**< Shifted mode WIREDANDPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE1_WIREDANDALT          (_GPIO_P_MODEH_MODE1_WIREDANDALT << 4)  /**< Shifted mode WIREDANDALT for GPIO_P_MODEH   */
#define GPIO_P_MODEH_MODE1_WIREDANDALTFILTER    (_GPIO_P_MODEH_MODE1_WIREDANDALTFILTER << 4) /**< Shifted mode WIREDANDALTFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE1_WIREDANDALTPULLUP    (_GPIO_P_MODEH_MODE1_WIREDANDALTPULLUP << 4) /**< Shifted mode WIREDANDALTPULLUP for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE1_WIREDANDALTPULLUPFILTER (_GPIO_P_MODEH_MODE1_WIREDANDALTPULLUPFILTER << 4) /**< Shifted mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/
#define _GPIO_P_MODEH_MODE2_SHIFT               8                                       /**< Shift value for GPIO_MODE2                  */
#define _GPIO_P_MODEH_MODE2_MASK                0xF00UL                                 /**< Bit mask for GPIO_MODE2                     */
#define _GPIO_P_MODEH_MODE2_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_P_MODEH               */
#define _GPIO_P_MODEH_MODE2_DISABLED            0x00000000UL                            /**< Mode DISABLED for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE2_INPUT               0x00000001UL                            /**< Mode INPUT for GPIO_P_MODEH                 */
#define _GPIO_P_MODEH_MODE2_INPUTPULL           0x00000002UL                            /**< Mode INPUTPULL for GPIO_P_MODEH             */
#define _GPIO_P_MODEH_MODE2_INPUTPULLFILTER     0x00000003UL                            /**< Mode INPUTPULLFILTER for GPIO_P_MODEH       */
#define _GPIO_P_MODEH_MODE2_PUSHPULL            0x00000004UL                            /**< Mode PUSHPULL for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE2_PUSHPULLALT         0x00000005UL                            /**< Mode PUSHPULLALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE2_WIREDOR             0x00000006UL                            /**< Mode WIREDOR for GPIO_P_MODEH               */
#define _GPIO_P_MODEH_MODE2_WIREDORPULLDOWN     0x00000007UL                            /**< Mode WIREDORPULLDOWN for GPIO_P_MODEH       */
#define _GPIO_P_MODEH_MODE2_WIREDAND            0x00000008UL                            /**< Mode WIREDAND for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE2_WIREDANDFILTER      0x00000009UL                            /**< Mode WIREDANDFILTER for GPIO_P_MODEH        */
#define _GPIO_P_MODEH_MODE2_WIREDANDPULLUP      0x0000000AUL                            /**< Mode WIREDANDPULLUP for GPIO_P_MODEH        */
#define _GPIO_P_MODEH_MODE2_WIREDANDPULLUPFILTER 0x0000000BUL                            /**< Mode WIREDANDPULLUPFILTER for GPIO_P_MODEH  */
#define _GPIO_P_MODEH_MODE2_WIREDANDALT         0x0000000CUL                            /**< Mode WIREDANDALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE2_WIREDANDALTFILTER   0x0000000DUL                            /**< Mode WIREDANDALTFILTER for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE2_WIREDANDALTPULLUP   0x0000000EUL                            /**< Mode WIREDANDALTPULLUP for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE2_WIREDANDALTPULLUPFILTER 0x0000000FUL                            /**< Mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE2_DEFAULT              (_GPIO_P_MODEH_MODE2_DEFAULT << 8)      /**< Shifted mode DEFAULT for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE2_DISABLED             (_GPIO_P_MODEH_MODE2_DISABLED << 8)     /**< Shifted mode DISABLED for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE2_INPUT                (_GPIO_P_MODEH_MODE2_INPUT << 8)        /**< Shifted mode INPUT for GPIO_P_MODEH         */
#define GPIO_P_MODEH_MODE2_INPUTPULL            (_GPIO_P_MODEH_MODE2_INPUTPULL << 8)    /**< Shifted mode INPUTPULL for GPIO_P_MODEH     */
#define GPIO_P_MODEH_MODE2_INPUTPULLFILTER      (_GPIO_P_MODEH_MODE2_INPUTPULLFILTER << 8) /**< Shifted mode INPUTPULLFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE2_PUSHPULL             (_GPIO_P_MODEH_MODE2_PUSHPULL << 8)     /**< Shifted mode PUSHPULL for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE2_PUSHPULLALT          (_GPIO_P_MODEH_MODE2_PUSHPULLALT << 8)  /**< Shifted mode PUSHPULLALT for GPIO_P_MODEH   */
#define GPIO_P_MODEH_MODE2_WIREDOR              (_GPIO_P_MODEH_MODE2_WIREDOR << 8)      /**< Shifted mode WIREDOR for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE2_WIREDORPULLDOWN      (_GPIO_P_MODEH_MODE2_WIREDORPULLDOWN << 8) /**< Shifted mode WIREDORPULLDOWN for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE2_WIREDAND             (_GPIO_P_MODEH_MODE2_WIREDAND << 8)     /**< Shifted mode WIREDAND for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE2_WIREDANDFILTER       (_GPIO_P_MODEH_MODE2_WIREDANDFILTER << 8) /**< Shifted mode WIREDANDFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE2_WIREDANDPULLUP       (_GPIO_P_MODEH_MODE2_WIREDANDPULLUP << 8) /**< Shifted mode WIREDANDPULLUP for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE2_WIREDANDPULLUPFILTER (_GPIO_P_MODEH_MODE2_WIREDANDPULLUPFILTER << 8) /**< Shifted mode WIREDANDPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE2_WIREDANDALT          (_GPIO_P_MODEH_MODE2_WIREDANDALT << 8)  /**< Shifted mode WIREDANDALT for GPIO_P_MODEH   */
#define GPIO_P_MODEH_MODE2_WIREDANDALTFILTER    (_GPIO_P_MODEH_MODE2_WIREDANDALTFILTER << 8) /**< Shifted mode WIREDANDALTFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE2_WIREDANDALTPULLUP    (_GPIO_P_MODEH_MODE2_WIREDANDALTPULLUP << 8) /**< Shifted mode WIREDANDALTPULLUP for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE2_WIREDANDALTPULLUPFILTER (_GPIO_P_MODEH_MODE2_WIREDANDALTPULLUPFILTER << 8) /**< Shifted mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/
#define _GPIO_P_MODEH_MODE3_SHIFT               12                                      /**< Shift value for GPIO_MODE3                  */
#define _GPIO_P_MODEH_MODE3_MASK                0xF000UL                                /**< Bit mask for GPIO_MODE3                     */
#define _GPIO_P_MODEH_MODE3_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_P_MODEH               */
#define _GPIO_P_MODEH_MODE3_DISABLED            0x00000000UL                            /**< Mode DISABLED for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE3_INPUT               0x00000001UL                            /**< Mode INPUT for GPIO_P_MODEH                 */
#define _GPIO_P_MODEH_MODE3_INPUTPULL           0x00000002UL                            /**< Mode INPUTPULL for GPIO_P_MODEH             */
#define _GPIO_P_MODEH_MODE3_INPUTPULLFILTER     0x00000003UL                            /**< Mode INPUTPULLFILTER for GPIO_P_MODEH       */
#define _GPIO_P_MODEH_MODE3_PUSHPULL            0x00000004UL                            /**< Mode PUSHPULL for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE3_PUSHPULLALT         0x00000005UL                            /**< Mode PUSHPULLALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE3_WIREDOR             0x00000006UL                            /**< Mode WIREDOR for GPIO_P_MODEH               */
#define _GPIO_P_MODEH_MODE3_WIREDORPULLDOWN     0x00000007UL                            /**< Mode WIREDORPULLDOWN for GPIO_P_MODEH       */
#define _GPIO_P_MODEH_MODE3_WIREDAND            0x00000008UL                            /**< Mode WIREDAND for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE3_WIREDANDFILTER      0x00000009UL                            /**< Mode WIREDANDFILTER for GPIO_P_MODEH        */
#define _GPIO_P_MODEH_MODE3_WIREDANDPULLUP      0x0000000AUL                            /**< Mode WIREDANDPULLUP for GPIO_P_MODEH        */
#define _GPIO_P_MODEH_MODE3_WIREDANDPULLUPFILTER 0x0000000BUL                            /**< Mode WIREDANDPULLUPFILTER for GPIO_P_MODEH  */
#define _GPIO_P_MODEH_MODE3_WIREDANDALT         0x0000000CUL                            /**< Mode WIREDANDALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE3_WIREDANDALTFILTER   0x0000000DUL                            /**< Mode WIREDANDALTFILTER for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE3_WIREDANDALTPULLUP   0x0000000EUL                            /**< Mode WIREDANDALTPULLUP for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE3_WIREDANDALTPULLUPFILTER 0x0000000FUL                            /**< Mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_DEFAULT              (_GPIO_P_MODEH_MODE3_DEFAULT << 12)     /**< Shifted mode DEFAULT for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE3_DISABLED             (_GPIO_P_MODEH_MODE3_DISABLED << 12)    /**< Shifted mode DISABLED for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE3_INPUT                (_GPIO_P_MODEH_MODE3_INPUT << 12)       /**< Shifted mode INPUT for GPIO_P_MODEH         */
#define GPIO_P_MODEH_MODE3_INPUTPULL            (_GPIO_P_MODEH_MODE3_INPUTPULL << 12)   /**< Shifted mode INPUTPULL for GPIO_P_MODEH     */
#define GPIO_P_MODEH_MODE3_INPUTPULLFILTER      (_GPIO_P_MODEH_MODE3_INPUTPULLFILTER << 12) /**< Shifted mode INPUTPULLFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_PUSHPULL             (_GPIO_P_MODEH_MODE3_PUSHPULL << 12)    /**< Shifted mode PUSHPULL for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE3_PUSHPULLALT          (_GPIO_P_MODEH_MODE3_PUSHPULLALT << 12) /**< Shifted mode PUSHPULLALT for GPIO_P_MODEH   */
#define GPIO_P_MODEH_MODE3_WIREDOR              (_GPIO_P_MODEH_MODE3_WIREDOR << 12)     /**< Shifted mode WIREDOR for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE3_WIREDORPULLDOWN      (_GPIO_P_MODEH_MODE3_WIREDORPULLDOWN << 12) /**< Shifted mode WIREDORPULLDOWN for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDAND             (_GPIO_P_MODEH_MODE3_WIREDAND << 12)    /**< Shifted mode WIREDAND for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE3_WIREDANDFILTER       (_GPIO_P_MODEH_MODE3_WIREDANDFILTER << 12) /**< Shifted mode WIREDANDFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDANDPULLUP       (_GPIO_P_MODEH_MODE3_WIREDANDPULLUP << 12) /**< Shifted mode WIREDANDPULLUP for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDANDPULLUPFILTER (_GPIO_P_MODEH_MODE3_WIREDANDPULLUPFILTER << 12) /**< Shifted mode WIREDANDPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDANDALT          (_GPIO_P_MODEH_MODE3_WIREDANDALT << 12) /**< Shifted mode WIREDANDALT for GPIO_P_MODEH   */
#define GPIO_P_MODEH_MODE3_WIREDANDALTFILTER    (_GPIO_P_MODEH_MODE3_WIREDANDALTFILTER << 12) /**< Shifted mode WIREDANDALTFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDANDALTPULLUP    (_GPIO_P_MODEH_MODE3_WIREDANDALTPULLUP << 12) /**< Shifted mode WIREDANDALTPULLUP for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE3_WIREDANDALTPULLUPFILTER (_GPIO_P_MODEH_MODE3_WIREDANDALTPULLUPFILTER << 12) /**< Shifted mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/
#define _GPIO_P_MODEH_MODE4_SHIFT               16                                      /**< Shift value for GPIO_MODE4                  */
#define _GPIO_P_MODEH_MODE4_MASK                0xF0000UL                               /**< Bit mask for GPIO_MODE4                     */
#define _GPIO_P_MODEH_MODE4_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_P_MODEH               */
#define _GPIO_P_MODEH_MODE4_DISABLED            0x00000000UL                            /**< Mode DISABLED for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE4_INPUT               0x00000001UL                            /**< Mode INPUT for GPIO_P_MODEH                 */
#define _GPIO_P_MODEH_MODE4_INPUTPULL           0x00000002UL                            /**< Mode INPUTPULL for GPIO_P_MODEH             */
#define _GPIO_P_MODEH_MODE4_INPUTPULLFILTER     0x00000003UL                            /**< Mode INPUTPULLFILTER for GPIO_P_MODEH       */
#define _GPIO_P_MODEH_MODE4_PUSHPULL            0x00000004UL                            /**< Mode PUSHPULL for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE4_PUSHPULLALT         0x00000005UL                            /**< Mode PUSHPULLALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE4_WIREDOR             0x00000006UL                            /**< Mode WIREDOR for GPIO_P_MODEH               */
#define _GPIO_P_MODEH_MODE4_WIREDORPULLDOWN     0x00000007UL                            /**< Mode WIREDORPULLDOWN for GPIO_P_MODEH       */
#define _GPIO_P_MODEH_MODE4_WIREDAND            0x00000008UL                            /**< Mode WIREDAND for GPIO_P_MODEH              */
#define _GPIO_P_MODEH_MODE4_WIREDANDFILTER      0x00000009UL                            /**< Mode WIREDANDFILTER for GPIO_P_MODEH        */
#define _GPIO_P_MODEH_MODE4_WIREDANDPULLUP      0x0000000AUL                            /**< Mode WIREDANDPULLUP for GPIO_P_MODEH        */
#define _GPIO_P_MODEH_MODE4_WIREDANDPULLUPFILTER 0x0000000BUL                            /**< Mode WIREDANDPULLUPFILTER for GPIO_P_MODEH  */
#define _GPIO_P_MODEH_MODE4_WIREDANDALT         0x0000000CUL                            /**< Mode WIREDANDALT for GPIO_P_MODEH           */
#define _GPIO_P_MODEH_MODE4_WIREDANDALTFILTER   0x0000000DUL                            /**< Mode WIREDANDALTFILTER for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE4_WIREDANDALTPULLUP   0x0000000EUL                            /**< Mode WIREDANDALTPULLUP for GPIO_P_MODEH     */
#define _GPIO_P_MODEH_MODE4_WIREDANDALTPULLUPFILTER 0x0000000FUL                            /**< Mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEH*/
#define GPIO_P_MODEH_MODE4_DEFAULT              (_GPIO_P_MODEH_MODE4_DEFAULT << 16)     /**< Shifted mode DEFAULT for GPIO_P_MODEH       */
#define GPIO_P_MODEH_MODE4_DISABLED             (_GPIO_P_MODEH_MODE4_DISABLED << 16)    /**< Shifted mode DISABLED for GPIO_P_MODEH      */
#define GPIO_P_MODEH_MODE4_INPUT                (_GPIO_P_MODEH_MODE4_INPUT << 16)       /**< Shifted mode INPUT for GPIO_P_MODEH         */
#define GPIO_P_MODEH_MODE4_INPUTPULL            (_GPIO_P_MODEH_MODE4_INPUTPULL << 16)   /**< Shifted mode INPUTPULL for GPIO_P_MODEH     */
