SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_gpio_port.h
/* Bit fields for GPIO_P DOUT */
#define _GPIO_P_DOUT_RESETVALUE                 0x00000000UL                            /**< Default value for GPIO_P_DOUT               */
#define _GPIO_P_DOUT_MASK                       0x00007FFFUL                            /**< Mask for GPIO_P_DOUT                        */
#define _GPIO_P_DOUT_DOUT_SHIFT                 0                                       /**< Shift value for GPIO_DOUT                   */
#define _GPIO_P_DOUT_DOUT_MASK                  0x7FFFUL                                /**< Bit mask for GPIO_DOUT                      */
#define _GPIO_P_DOUT_DOUT_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_P_DOUT                */
#define GPIO_P_DOUT_DOUT_DEFAULT                (_GPIO_P_DOUT_DOUT_DEFAULT << 0)        /**< Shifted mode DEFAULT for GPIO_P_DOUT        */

/* Bit fields for GPIO_P DIN */
#define _GPIO_P_DIN_RESETVALUE                  0x00000000UL                            /**< Default value for GPIO_P_DIN                */
#define _GPIO_P_DIN_MASK                        0x00007FFFUL                            /**< Mask for GPIO_P_DIN                         */
#define _GPIO_P_DIN_DIN_SHIFT                   0                                       /**< Shift value for GPIO_DIN                    */
#define _GPIO_P_DIN_DIN_MASK                    0x7FFFUL                                /**< Bit mask for GPIO_DIN                       */
#define _GPIO_P_DIN_DIN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for GPIO_P_DIN                 */
#define GPIO_P_DIN_DIN_DEFAULT                  (_GPIO_P_DIN_DIN_DEFAULT << 0)          /**< Shifted mode DEFAULT for GPIO_P_DIN         */
/** @} End of group Parts */


#endif // GPIO_PORT_H
